Dony-kylin/STM32H743/Expand/Src/ad7606_scope.c
  minimum = samples[0];
  maximum = samples[0];
  for (uint32_t i = 0U; i < count; ++i)
  {
    int32_t value = samples[i];

    if (value < minimum)
    {
      minimum = (int16_t)value;
    }
    if (value > maximum)
    {
      maximum = (int16_t)value;
    }
    sum += value;
    sum_squares += (uint64_t)((int64_t)value * value);
  }

  mean = (int32_t)(sum / (int64_t)count);
  {
    int64_t mean_square = (int64_t)(sum_squares / count);
    int64_t dc_square = (int64_t)mean * mean;
    variance = (mean_square > dc_square) ?
               (uint64_t)(mean_square - dc_square) : 0U;
  }
  rms_raw = ScopeIntegerSqrt(variance);

  /*
   * Use the whole 16384-point block instead of only the last six periods.
   * At 500 kHz and 8 MSPS this averages about 1023 periods. Q16 linear
   * interpolation removes the remaining one-sample crossing quantization.
   */
  hysteresis = ((int32_t)maximum - (int32_t)minimum) / 20;
  if (hysteresis < 8)
  {
    hysteresis = 8;
  }

  for (uint32_t i = 1U; i < count; ++i)
  {
    int32_t previous = samples[i - 1U];
    int32_t current = samples[i];

    if (current <= (mean - hysteresis))
    {
      trigger_armed = 1U;
    }
    else if ((trigger_armed != 0U) &&
             (current >= (mean + hysteresis)))
    {
      int32_t threshold = mean + hysteresis;
      int32_t delta = current - previous;
      uint32_t fraction_q16 = 0U;
      uint64_t crossing_q16;

      if ((delta > 0) && (previous < threshold))
      {
        int64_t numerator =
            ((int64_t)threshold - previous) << 16U;
        uint64_t fraction = (uint64_t)(numerator / delta);
        fraction_q16 = (fraction < 65536U) ?
                       (uint32_t)fraction : 65535U;
      }

      crossing_q16 =
          ((uint64_t)(i - 1U) << 16U) + fraction_q16;
      if (crossing_count == 0U)
      {
        first_crossing_q16 = crossing_q16;
      }
      last_crossing_q16 = crossing_q16;
      ++crossing_count;
      trigger_armed = 0U;
    }
  }

  if ((crossing_count >= 2U) &&
      (last_crossing_q16 > first_crossing_q16))
  {
    uint64_t periods = crossing_count - 1U;
    uint64_t span_q16 = last_crossing_q16 - first_crossing_q16;
    uint64_t numerator =
        (uint64_t)input_sample_rate_hz * 1000U * periods;

    frequency_millihz =
        (uint32_t)((numerator << 16U) / span_q16);
  }

  {
    uint32_t peak_to_peak_mv = (uint32_t)ScopeRawToMv(
        (int32_t)maximum - (int32_t)minimum);
    AD7606_ScopeMeasurements measurements;

    measurements.voltage_mv =
        ScopeRawToMv(samples[count - 1U]);
    measurements.dc_mv = ScopeRawToMv(mean);
    measurements.amplitude_mv = (peak_to_peak_mv + 1U) / 2U;
    measurements.peak_to_peak_mv = peak_to_peak_mv;
    measurements.rms_mv = (uint32_t)ScopeRawToMv((int32_t)rms_raw);
    measurements.frequency_millihz = frequency_millihz;
    measurements.sample_rate_hz = input_sample_rate_hz;
    measurements.valid = 1U;

    taskENTER_CRITICAL();
    scope_measurements = measurements;
    taskEXIT_CRITICAL();
  }
}

#if 0
static uint32_t ScopeEstimateFrequencyFft(
    const int16_t *samples, uint32_t count, int32_t mean,
    uint32_t input_sample_rate_hz)
{
  float window_cos = 1.0f;
  float window_sin = 0.0f;
  float window_step_cos;
  float window_step_sin;
  float peak_power = 0.0f;
  uint32_t minimum_bin;
  uint32_t maximum_bin;
  uint32_t peak_bin = 0U;

  if ((samples == NULL) || (count < SCOPE_FFT_SIZE) ||
      (input_sample_rate_hz == 0U))
  {
    return 0U;
  }

  window_step_cos =
      cosf((2.0f * SCOPE_PI_F) / (float)(SCOPE_FFT_SIZE - 1U));
  window_step_sin =
      sinf((2.0f * SCOPE_PI_F) / (float)(SCOPE_FFT_SIZE - 1U));

  /* Remove DC and apply a Hann window before the in-place complex FFT. */
  for (uint32_t i = 0U; i < SCOPE_FFT_SIZE; ++i)
  {
    float window = 0.5f - (0.5f * window_cos);
    float next_cos =
        (window_cos * window_step_cos) -
        (window_sin * window_step_sin);
    float next_sin =
        (window_sin * window_step_cos) +
        (window_cos * window_step_sin);

    scope_fft_buffer[2U * i] =
        ((float)samples[i] - (float)mean) * window;
    scope_fft_buffer[(2U * i) + 1U] = 0.0f;
    window_cos = next_cos;
    window_sin = next_sin;
  }

  /* Iterative radix-2 bit reversal. */
  {
    uint32_t reversed = 0U;

    for (uint32_t i = 1U; i < SCOPE_FFT_SIZE; ++i)
    {
      uint32_t bit = SCOPE_FFT_SIZE >> 1U;

      while ((reversed & bit) != 0U)
      {
        reversed ^= bit;
        bit >>= 1U;
      }
      reversed ^= bit;

      if (i < reversed)
      {
        float real = scope_fft_buffer[2U * i];
        float imaginary = scope_fft_buffer[(2U * i) + 1U];

        scope_fft_buffer[2U * i] =
            scope_fft_buffer[2U * reversed];
        scope_fft_buffer[(2U * i) + 1U] =
            scope_fft_buffer[(2U * reversed) + 1U];
        scope_fft_buffer[2U * reversed] = real;
        scope_fft_buffer[(2U * reversed) + 1U] = imaginary;
      }
    }
  }

  /* In-place radix-2 Cooley-Tukey FFT. */
  for (uint32_t length = 2U;
       length <= SCOPE_FFT_SIZE;
       length <<= 1U)
  {
    uint32_t half = length >> 1U;
    float angle = (-2.0f * SCOPE_PI_F) / (float)length;
    float step_real = cosf(angle);
    float step_imaginary = sinf(angle);

    for (uint32_t base = 0U; base < SCOPE_FFT_SIZE; base += length)
    {
      float twiddle_real = 1.0f;
      float twiddle_imaginary = 0.0f;

      for (uint32_t j = 0U; j < half; ++j)
      {
        uint32_t even = base + j;
        uint32_t odd = even + half;
        float odd_real =
            scope_fft_buffer[2U * odd];
        float odd_imaginary =
            scope_fft_buffer[(2U * odd) + 1U];
        float rotated_real =
            (twiddle_real * odd_real) -
            (twiddle_imaginary * odd_imaginary);
        float rotated_imaginary =
            (twiddle_real * odd_imaginary) +
            (twiddle_imaginary * odd_real);
        float even_real =
            scope_fft_buffer[2U * even];
        float even_imaginary =
            scope_fft_buffer[(2U * even) + 1U];
        float next_twiddle_real =
            (twiddle_real * step_real) -
            (twiddle_imaginary * step_imaginary);

        scope_fft_buffer[2U * even] =
            even_real + rotated_real;
        scope_fft_buffer[(2U * even) + 1U] =
            even_imaginary + rotated_imaginary;
        scope_fft_buffer[2U * odd] =
            even_real - rotated_real;
        scope_fft_buffer[(2U * odd) + 1U] =
            even_imaginary - rotated_imaginary;
        twiddle_imaginary =
            (twiddle_imaginary * step_real) +
            (twiddle_real * step_imaginary);
        twiddle_real = next_twiddle_real;
      }
    }
  }

  minimum_bin = (uint32_t)
      (((uint64_t)SCOPE_FFT_MIN_FREQUENCY_HZ *
        SCOPE_FFT_SIZE + input_sample_rate_hz - 1U) /
       input_sample_rate_hz);
  maximum_bin = (uint32_t)
      (((uint64_t)SCOPE_FFT_MAX_FREQUENCY_HZ *
        SCOPE_FFT_SIZE) / input_sample_rate_hz);
  if (minimum_bin < 1U)
  {
    minimum_bin = 1U;
  }
  if (maximum_bin >= (SCOPE_FFT_SIZE / 2U))
  {
    maximum_bin = (SCOPE_FFT_SIZE / 2U) - 1U;
  }
  if (minimum_bin > maximum_bin)
  {
    return 0U;
  }

